In [1]:
import numpy as np
import pandas as pd

In [10]:
vals1 = np.array([1, None, 3, 4])
vals1

array([1, None, 3, 4], dtype=object)

In [3]:
vals1.sum()   #정수와 None의 덧셈이 정의돼 있지 않다는 사실을 보여준다

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [12]:
vals2 = np.array([1, np.nan, 3, 4]) #NaN은 부동소숫점 표기를 사용한다.
vals2.dtype

dtype('float64')

In [22]:
1 + np.nan  # NaN이 포함된 산술 연산의 결과는 또 다른 NaN이다

nan

In [23]:
0 *  np.nan

nan

In [24]:
vals2.sum(), vals2.min(), vals2.max()

(nan, nan, nan)

In [13]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2) 
# NaN은 부동 소수점 값이라는 것을 유념하자 , 정수나 문자열 등 다른 타입에는 NaN에 해당하는 값이 없다

(8.0, 1.0, 4.0)

In [26]:
pd.Series([1, np.nan, 2, None]) # Na값이 있으면 Pandas가 자동으로 부동 소숫점 타입으로 변환한다,

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [30]:
x = pd.Series(range(2), dtype=int)   # 0, 1에 해댕돠는 int 값이 저장된다.
x

0    0
1    1
dtype: int64

In [34]:
x[0] = None # None값이 저장되면 부동 소숫점으로 변환 된다.
x

0    NaN
1    1.0
dtype: float64

In [37]:
# null 값 탐지
data = pd.Series([1, np.nan, 'hello', None]) 
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [38]:
# 부울 마스크는 Series나 DataFrame인덱스로 직접 사용될 수 있다.
data[data.notnull()]

0        1
2    hello
dtype: object

In [40]:
# null 값 제거하기
data.dropna() #NA 값을 제거하기

0        1
2    hello
dtype: object

In [14]:
df = pd.DataFrame([[1,      np.nan, 2],
                                [2,      3,      5],
                                [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [42]:
# DataFrame에서는 단일 값만 삭제할 수 없으며, 전체 행이나 전체 열을 삭제하는 것만 가능하다
df.dropna()# dropna()는 널 값이 있는 모든 행을 삭제할 것이다.

     0    1  2
1  2.0  3.0  5

In [20]:
df.dropna(axis='columns') # axis= 1은 널 값을 포함하는 모든 열을 삭제한다
                                         # 이 방식은 일부 유효한 데이터도 삭제한다

   2
0  2
1  5
2  6

In [48]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [51]:
df.dropna(axis='columns') # 기본 설정값은 how = ‘any’로, 널값을 포함하는 행이나 열(axis 키워드에 따라 정해짐)을 모두 삭제한다

   2
0  2
1  5
2  6

In [57]:
df.dropna(axis='columns', how='all') # how=’all’로 지정해 모두 널 값인 행이나 열만 삭제할 수 있다

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [58]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [21]:
df.dropna(axis='rows', thresh=3) # 첫번째와 마지막 행이 삭제되는데, 거기에서 단 두 개의 값만이 널 값이 아니기 때문이다. # rows=index=0

     0    1  2
1  2.0  3.0  5

In [63]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [64]:
data.fillna(0) # 0과 같은 단일 값으로 NA항목을 채울 수 있다

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [66]:
data

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [69]:
data.fillna(method='ffill') # 이전값으로 채우도록 지정할 수도 있다

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [70]:
data.fillna(method='bfill') # 뒤에 있는 값을 앞으로 전달하도록 지정할 수 있다

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [72]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [73]:
df.fillna(method='ffill', axis=1) # 열의 앞의 값으로 채운다.

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0